---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalFixityState.Released
enum: Autodesk.Revit.DB.Structure.AnalyticalFixityState
source: html/2bb0f017-c647-e476-6d54-68dabf41e81b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalFixityState.Released

Degree of freedom is Released.